app/views/parties/_form.html.erb

SELECT "locations".* FROM "locations" WHERE ("locations".host_id = 2)
---
    <%= f.label :location_id %><br />
    <%= f.collection_select :location_id, Location.all, :id, :name %>

SELECT "party_types".* FROM "party_types" ORDER BY name
---
    <%= f.label :party_type_id %><br />
    <%= f.collection_select :party_type_id, PartyType.all, :id, :name %>