app/views/gifts/_form.html.erb

    <%= f.label :invitation_id %><br />
    <%= f.collection_select :invitation_id, Invitation.all, :id, :invite_code %>
---
SELECT "invitations".* FROM "invitations" ORDER BY party_id