app/views/invitations/_form.html.erb

    <%= f.label :party_id %><br />
    <%= f.collection_select :party_id, Party.all, :id, :name %>
---
SELECT "parties".* FROM "parties" WHERE ("parties".host_id = 2)

    <%= f.label :guest_id %><br />
    <%= f.collection_select :guest_id, Guest.all, :id, :name %>
---
SELECT "guests".* FROM "guests" WHERE ("guests".host_id = 2)