app/controllers/gifts_controller.rb

SELECT "gifts".* FROM "gifts" ORDER BY invitation_id
---
  def index
    @gifts = Gift.all

SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = 1 LIMIT 1
---
  def show
    @gift = Gift.find(params[:id])

INSERT INTO "gifts" ("invitation_id", "description", "note_sent_on", "created_at", "updated_at") VALUES (3, 'yesssssssssssssssssssssssssssssssssssss', '2011-04-27', '2011-04-27 20:18:20.502865', '2011-04-27 20:18:20.502865')
---
  def create
    @gift = Gift.new(params[:gift])
    if @gift.save