app/controllers/guests_controller.rb

SELECT "guests".* FROM "guests" WHERE ("guests".host_id = 2) ORDER BY name
---
  def index
    @guests = current_host.guests.all

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 1 LIMIT 1
---
  def show
    @guest = Guest.find(params[:id])

INSERT INTO "guests" ("name", "email", "host_id", "notes", "created_at", "updated_at") VALUES ('Nikki', 'blah@bla.com', NULL, 'Blacklisted', '2011-04-22 02:53:01.478359', '2011-04-22 02:53:01.478359')
---
  def create
    @guest = Guest.new(params[:guest])
    @guest.host_id = current_host.id
    if @guest.save

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 3 LIMIT 1
---
  def edit
    @guest = Guest.find(params[:id])

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 5 LIMIT 1
UPDATE "guests" SET "name" = 'Rick Artis', "updated_at" = '2011-04-29 18:49:51.397082' WHERE "guests"."id" = 10
---
  def update
    @guest = Guest.find(params[:id])
    if @guest.update_attributes(params[:guest])

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 1 LIMIT 1
DELETE FROM "guests" WHERE "guests"."id" = 1
---
  def destroy
    @guest = Guest.find(params[:id])
    @guest.destroy