app/controllers/invitations_controller.rb

SELECT "invitations".* FROM "invitations" INNER JOIN "guests" ON "invitations".guest_id = "guests".id WHERE (("guests".host_id = 1)) ORDER BY expected_attendees
---
  def index
    @invitations = current_host.invitations.all

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = 0 LIMIT 1
---
  def show
    @invitation = Invitation.find(params[:id])

INSERT INTO "invitations" ("party_id", "guest_id", "invite_code", "expected_attendees", "actual_attendees", "created_at", "updated_at") VALUES (1, 2, NULL, 27, NULL, '2011-04-27 04:39:50.161584', '2011-04-27 04:39:50.161584')
DELETE FROM "invitations" WHERE "invitations"."id" = 3
---
  def create
    @invitation = Invitation.new(params[:invitation])
    old = @invitation.already_invited
    if old.nil?
      @invitation.random_invite_code
    else
      @invitation.invite_code = old.invite_code
    end
    if @invitation.save
      if old.nil?
        FriendMailer.new_invitation_msg(@invitation).deliver
        redirect_to @invitation, :notice => "Invitation was successfully created"
      else
        old.destroy

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = 4 LIMIT 1
---
  def edit
    @invitation = Invitation.find(params[:id])

SELECT "invitations".* FROM "invitations" WHERE "invitations"."invite_code" = '8o815ydp5q4yeyjw' LIMIT 1
---
  def details
    @invitation = Invitation.find_by_invite_code(params[:invite_code])

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = 4 LIMIT 1
UPDATE "invitations" SET "actual_attendees" = 2, "updated_at" = '2011-05-03 19:54:31.464382' WHERE "invitations"."id" = 5
---
  def update
    @invitation = Invitation.find(params[:id])
    if @invitation.update_attributes(params[:invitation])