app/controllers/locations_controller.rb

  def index
    @locations = current_host.locations.all
---
SELECT "locations".* FROM "locations" WHERE ("locations".host_id = 2) ORDER BY name

  def create
    @location = Location.new(params[:location])
    @location.host_id = current_host.id

    if @location.save
---
INSERT INTO "locations" ("host_id", "name", "street", "city", "state", "zip", "latitude", "longitude", "created_at", "updated_at") VALUES (1, 'Hunt Library', '493 Frew Street', 'Pittsburgh', 'Pennsylvania', 15217, 40.4409744, -79.9443148, '2011-05-03 00:18:13.288961', '2011-05-03 00:18:13.288961')

  def edit
    @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 3 LIMIT 1

  def update
    @location = Location.find(params[:id])
    if @location.update_attributes(params[:location])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 3 LIMIT 1
UPDATE "locations" SET "latitude" = 40.445326, "longitude" = -79.9425887, "updated_at" = '2011-05-02 05:06:46.416388' WHERE "locations"."id" = 3

  def destroy
    @location = Location.find(params[:id])
    @location.destroy
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 1 LIMIT 1
DELETE FROM "locations" WHERE "locations"."id" = 1