app/controllers/party_types_controller.rb

  def index
    @party_types = current_host.party_types.all
---
SELECT "party_types".* FROM "party_types" ORDER BY name

  def show
    @party_type = PartyType.find(params[:id])
---
SELECT "party_types".* FROM "party_types" WHERE "party_types"."id" = 2 LIMIT 1

  def create
    @party_type = PartyType.new(params[:party_type])
    @party_type.active = false
    if @party_type.save
---
INSERT INTO "party_types" ("name", "active", "created_at", "updated_at") VALUES ('d', NULL, '2011-04-22 03:17:09.903205', '2011-04-22 03:17:09.903205')

  def destroy
    @party_type = PartyType.find(params[:id])
    @party_type.destroy
---
SELECT "party_types".* FROM "party_types" WHERE "party_types"."id" = 2 LIMIT 1
DELETE FROM "party_types" WHERE "party_types"."id" = 2