app/controllers/parties_controller.rb

  def index
    @parties = Party.all
---
SELECT "parties".* FROM "parties" WHERE ("parties".host_id = 1) ORDER BY name

  def show
    @party = Party.find(params[:id])
---
SELECT "parties".* FROM "parties" WHERE "parties"."id" = 1 LIMIT 1

  def create
    @party = Party.new(params[:party])
    @party.host_id = current_host.id

    if @party.save
---
INSERT INTO "parties" ("party_type_id", "host_id", "name", "location_id", "party_date", "start_time", "end_time", "description", "rsvp_date", "created_at", "updated_at") VALUES (NULL, 1, 'jlj', 1, '2011-04-22', '2011-04-22 02:16:00.000000', '2011-04-22 02:16:00.000000', '', '2011-04-22', '2011-04-22 02:17:46.819947', '2011-04-22 02:17:46.819947')

  def edit
    @party = Party.find(params[:id])
---
SELECT "parties".* FROM "parties" WHERE "parties"."id" = 1 LIMIT 1

  def update
    @party = Party.find(params[:id])
    if @party.update_attributes(params[:party])
---
SELECT "parties".* FROM "parties" WHERE "parties"."id" = 1 LIMIT 1
UPDATE "parties" SET "end_time" = '2000-01-01 17:07:00.000000', "updated_at" = '2011-05-02 16:44:44.040824' WHERE "parties"."id" = 5